{"loss": "mape", "optimizer": {"nesterov": false, "lr": 0.20000000298023224, "name": "SGD", "momentum": 0.800000011920929, "decay": 0.0010000000474974513}, "class_name": "Sequential", "keras_version": "1.0.4", "config": [{"class_name": "Dropout", "config": {"p": 0.2, "batch_input_shape": [null, 196], "trainable": true, "name": "dropout_1", "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 196}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 98}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}], "sample_weight_mode": null}