{"loss": "mape", "optimizer": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "lr": 0.0010000000474974513, "name": "Adam"}, "class_name": "Sequential", "keras_version": "1.0.4", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_325", "output_dim": 189, "activity_regularizer": null, "trainable": true, "init": "normal", "bias": true, "input_dtype": "float32", "input_dim": 189, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "batch_input_shape": [null, 189]}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_326", "activity_regularizer": null, "trainable": true, "init": "normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 1024}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_327", "activity_regularizer": null, "trainable": true, "init": "normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 512}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_328", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}], "sample_weight_mode": null}