{"loss": "mape", "optimizer": {"nesterov": false, "lr": 0.10000000149011612, "name": "SGD", "momentum": 0.800000011920929, "decay": 0.019999999552965164}, "class_name": "Sequential", "keras_version": "1.0.4", "config": [{"class_name": "Dropout", "config": {"p": 0.2, "batch_input_shape": [null, 196], "trainable": true, "name": "dropout_9", "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_9", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 196}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_10"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_10", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 98}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_11"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_11", "activity_regularizer": null, "trainable": true, "init": "uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 49}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_12"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_12", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}], "sample_weight_mode": null}